export const adkhars = {
    title: 'காலை & மாலை திக்ருகள்',
    description: `<b>அல்லாஹ் அல்-குர்ஆனில் கூறுகிறான்</b>: 
"<b>மாலையிலும் காலையிலும்</b> உம் இறைவனைப் புகழ்ந்து, தஸ்பீஹு (துதி) செய்து கொண்டு இருப்பீராக! - <b> ஸூரத்துல் முஃமின் 40:55 </b>"

ஏதாவது ஒரு <b>சிறிய துஆவை மனப்பாடம் செய்து, அதை வழக்கமாக ஓதி</b>, அதன் நன்மைகளை அடைய முயற்சி செய்வோம். அல்லாஹ் அருள் புரிவானாக.`,
    data: {
        morning_and_evening_adkhars_videos: [
            {
                title: 'நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) காட்டித் தந்த காலையில் ஓத வேண்டிய திக்ருகள்',
                youtube_link: 'https://www.youtube.com/watch?v=P8EIBksC0MA',
            },
            {
                title: 'நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) காட்டித் தந்த மாலையில் ஓத வேண்டிய திக்ருகள்',
                youtube_link: 'https://www.youtube.com/watch?v=fQUbhEHetks',
            },
        ],
        morning_and_evening_adkhars_text: {
            morning: [
                {
                    title: 'துஆ 1 (காலை & மாலை)',
                    description: '',
                    arabic: `رَضِيتُ بِاللَّهِ رَبًّا،
وَبِالإِسْلَامِ دِينًا،
وَبِمُحَمَّدٍ ﷺ نَبِيًّا`,
                    tamilTransliteration: `ரழீது பில்லாஹி ரப்பா,
வ பில்இஸ்லாமி தீனா,
வ பி முஹம்மதின் ﷺ நபிய்யா`,
                    tamilTranslation:
                        'அல்லாஹ்வை என் இறைவனாகவும், இஸ்லாமை என் மார்க்கமாகவும், முஹம்மது ﷺ அவர்களை என் நபியாகவும் ஏற்றுக்கொண்டேன்.',
                    ref: 'ஆதாரம்: அபூதாவூத்: 5072, ஜாமி அத் திர்மிதி: 3389',
                    audio: '/assets/audios/adkhars/DUA_MRN_EVE_RALITHU.mp3',
                    note: `🌟 ஓதுவதனால் வரும் நன்மைகள்
அல்லாஹ்வின் திருப்தி கிடைக்கும்
ஈமான் உறுதியாகும்`,
                },
                {
                    title: 'துஆ 2 (காலை & மாலை)',
                    description: '',
                    arabic: `يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ،
أَصْلِحْ لِي شَأْنِي كُلَّهُ،
وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ`,
                    tamilTransliteration: `யா ஹய்யு யா கய்யூம், பி ரஹ்மதிக அஸ்தகீஸ்,
அஸ்லிஹ் லீ ஷஅ்னீ குல்லஹு,
வ லா தகில்னீ இலா நப்ஸீ தர்ஃபத அய்ன்`,
                    tamilTranslation: `ஓ நித்திய உயிருள்ளவனே! அனைத்தையும் நிலைநிறுத்துபவனே!
உன் அருளால் நான் உதவி கேட்கிறேன்.
என் அனைத்து காரியங்களையும் சரியாக்குவாயாக.
ஒரு கண் இமைக்கும் நேரம்கூட என்னை எனக்கே ஒப்படைக்காதே.`,
                    ref: 'ஆதாரம்: ஸுனன் அந்நஸாஈ, அல்-அதப் அல்-முஃப்ரத்',
                    audio: '/assets/audios/adkhars/DUA_MRN_EVE_YAAHAYYU.mp3',
                    note: `🌟 ஓதுவதனால் வரும் நன்மைகள் (ஹதீஸ் அடிப்படையில்)
நபி ﷺ அவர்கள் காலை & மாலை ஓதுமாறு உபதேசித்த துஆ
இது முக்கியமான நபி ﷺ அவர்களின் வழிகாட்டுதல் (சுன்னா)
    இந்த துஆவில்:
அல்லாஹ்வின் அருளை நாடுதல்
அனைத்து காரியங்களும் சரியாக்கப்பட வேண்டுமென்று கேட்பது
தன்நம்பிக்கையில் அல்ல, அல்லாஹ்வின் உதவியில் நம்பிக்கை வைப்பது`,
                },
                {
                    title: 'துஆ 3',
                    description: '',
                    arabic: `أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ،
لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ،
لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ،
رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ، وَخَيْرَ مَا بَعْدَهُ،
وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ، وَشَرِّ مَا بَعْدَهُ،
رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ،
رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ`,
                    tamilTransliteration: `அஸ்பஹ்னா வ அஸ்பஹல் முல்கு லில்லாஹி, வல் ஹம்து லில்லாஹ்,
லா இலாஹ இல்லல்லாஹு வஹ்தஹூ லா ஷரீக லஹூ,
லஹுல் முல்கு வ லஹுல் ஹம்து, வ ஹுவா அலா குல்லி ஷெய்இன் கதீர்,
ரப்பி அஸ்அலுக கைர மா ஃபீ ஹாதல் யவ்ம், வ கைர மா பஅ்தஹு,
வ அஊது பிக மின் ஷர்ரி மா ஃபீ ஹாதல் யவ்ம், வ ஷர்ரி மா பஅ்தஹு,
ரப்பி அஊது பிக மினல் கஸலி வ சூஇல் கிபர்,
ரப்பி அஊது பிக மின் அதாபின் ஃபின்னார் வ அதாபின் ஃபில்கப்ர்`,
                    tamilTranslation: `நாம் காலையில் எழுந்தோம்; அரசும் புகழும் அல்லாஹ்வுக்கே.
அல்லாஹ்வைத் தவிர வேறு வணக்கத்திற்குரியவன் இல்லை; அவன் ஒருவனே; அவனுக்கு இணை இல்லை.
அரசும் புகழும் அவனுக்கே; அவன் அனைத்தையும் செய்ய வல்லவன்.
என் இறைவா! இந்நாளில் உள்ள நன்மையையும், அதற்குப் பிறகுள்ள நன்மையையும் நான் உன்னிடம் கேட்கிறேன்.
இந்த நாளின் தீமையிலிருந்தும், அதற்குப் பிறகுள்ள தீமையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.
என் இறைவா! சோம்பேறித்தனத்திலிருந்தும், வயதின் தீமையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.
நரக வேதனையிலிருந்தும், கப்ரின் வேதனையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.`,
                    hadith: '',
                    ref: 'ஆதாரம்: ஸஹீஹுல் முஸ்லிம்',
                    audio: '/assets/audios/adkhars/DUA_MRNG_ADKHAR.mp3',
                    note: ``,
                },
            ],
            evening: [
                {
                    title: 'துஆ 1 (காலை & மாலை)',
                    description: '',
                    arabic: `رَضِيتُ بِاللَّهِ رَبًّا،
وَبِالإِسْلَامِ دِينًا،
وَبِمُحَمَّدٍ ﷺ نَبِيًّا`,
                    tamilTransliteration: `ரழீது பில்லாஹி ரப்பா,
வ பில்இஸ்லாமி தீனா,
வ பி முஹம்மதின் ﷺ நபிய்யா`,
                    tamilTranslation:
                        'அல்லாஹ்வை என் இறைவனாகவும், இஸ்லாமை என் மார்க்கமாகவும், முஹம்மது ﷺ அவர்களை என் நபியாகவும் ஏற்றுக்கொண்டேன்.',
                    ref: 'ஆதாரம்: அபூதாவூத்: 5072, ஜாமி அத் திர்மிதி: 3389',
                    audio: '/assets/audios/adkhars/DUA_MRN_EVE_RALITHU.mp3',
                    note: `🌟 ஓதுவதனால் வரும் நன்மைகள்
அல்லாஹ்வின் திருப்தி கிடைக்கும்
ஈமான் உறுதியாகும்`,
                },
                {
                    title: 'துஆ 2 (காலை & மாலை)',
                    description: '',
                    arabic: `يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ،
أَصْلِحْ لِي شَأْنِي كُلَّهُ،
وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ`,
                    tamilTransliteration: `யா ஹய்யு யா கய்யூம், பி ரஹ்மதிக அஸ்தகீஸ்,
அஸ்லிஹ் லீ ஷஅ்னீ குல்லஹு,
வ லா தகில்னீ இலா நப்ஸீ தர்ஃபத அய்ன்`,
                    tamilTranslation: `ஓ நித்திய உயிருள்ளவனே! அனைத்தையும் நிலைநிறுத்துபவனே!
உன் அருளால் நான் உதவி கேட்கிறேன்.
என் அனைத்து காரியங்களையும் சரியாக்குவாயாக.
ஒரு கண் இமைக்கும் நேரம்கூட என்னை எனக்கே ஒப்படைக்காதே.`,
                    ref: 'ஆதாரம்: ஸுனன் அந்நஸாஈ, அல்-அதப் அல்-முஃப்ரத்',
                    audio: '/assets/audios/adkhars/DUA_MRN_EVE_YAAHAYYU.mp3',
                    note: `🌟 ஓதுவதனால் வரும் நன்மைகள் (ஹதீஸ் அடிப்படையில்)
நபி ﷺ அவர்கள் காலை & மாலை ஓதுமாறு உபதேசித்த துஆ
இது முக்கியமான நபி ﷺ அவர்களின் வழிகாட்டுதல் (சுன்னா)
    இந்த துஆவில்:
அல்லாஹ்வின் அருளை நாடுதல்
அனைத்து காரியங்களும் சரியாக்கப்பட வேண்டுமென்று கேட்பது
தன்நம்பிக்கையில் அல்ல, அல்லாஹ்வின் உதவியில் நம்பிக்கை வைப்பது`,
                },
                {
                    title: 'துஆ 3',
                    arabic: `أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ،
لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ،
لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ،
رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ، وَخَيْرَ مَا بَعْدَهَا،
وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا،
رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ،
رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ`,
                    tamilTransliteration: `அம்ஸைனா வ அம்ஸல் முல்கு லில்லாஹி, வல் ஹம்து லில்லாஹ்,
லா இலாஹ இல்லல்லாஹு வஹ்தஹூ லா ஷரீக லஹூ,
லஹுல் முல்கு வ லஹுல் ஹம்து, வ ஹுவா அலா குல்லி ஷெய்இன் கதீர்,
ரப்பி அஸ்அலுக கைர மா ஃபீ ஹாதிஹில் லைலதி, வ கைர மா பஅ்தஹா,
வ அஊது பிக மின் ஷர்ரி மா ஃபீ ஹாதிஹில் லைலதி, வ ஷர்ரி மா பஅ்தஹா,
ரப்பி அஊது பிக மினல் கஸலி வ சூஇல் கிபர்,
ரப்பி அஊது பிக மின் அதாபின் ஃபின்னார் வ அதாபின் ஃபில்கப்ர்`,
                    tamilTranslation: `நாம் மாலையை அடைந்தோம்; அரசும் புகழும் அல்லாஹ்வுக்கே.
அல்லாஹ்வைத் தவிர வேறு வணக்கத்திற்குரியவன் இல்லை; அவன் ஒருவனே; அவனுக்கு இணை இல்லை.
அரசும் புகழும் அவனுக்கே; அவன் அனைத்தையும் செய்ய வல்லவன்.
என் இறைவா! இந்த இரவில் உள்ள நன்மையையும், அதற்குப் பிறகுள்ள நன்மையையும் நான் உன்னிடம் கேட்கிறேன்.
இந்த இரவின் தீமையிலிருந்தும், அதற்குப் பிறகுள்ள தீமையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.
என் இறைவா! சோம்பேறித்தனத்திலிருந்தும், வயதின் தீமையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.
நரக வேதனையிலிருந்தும், கப்ரின் வேதனையிலிருந்தும் உன்னிடம் பாதுகாப்பு கேட்கிறேன்.`,
                    ref: 'ஆதாரம்: ஸஹீஹுல் முஸ்லிம்',
                    audio: '/assets/audios/adkhars/DUA_EVEN_ADKHAR.mp3',
                },
            ],
        },
    },
};
