// Table of Contents for Significant Verses and Suras
// Important verses and suras recommended by Prophet Muhammad ﷺ

const significantTableOfContents = {
    morning_and_evening_adkhars: [
        {
            title: 'நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) காட்டித் தந்த காலையில் ஓத வேண்டிய திக்ருகள்',
            youtube_link: 'https://www.youtube.com/watch?v=P8EIBksC0MA',
        },
        {
            title: 'நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) காட்டித் தந்த மாலையில் ஓத வேண்டிய திக்ருகள்',
            youtube_link: 'https://www.youtube.com/watch?v=fQUbhEHetks',
        },
    ],
    suras: [
        {
            title: 'ஸூரத்து யாஸீன்',
            path: 'sura_yaseen.json',
        },
        {
            title: 'ஸூரத்துல் முல்க்',
            description:
                '1. நபி ﷺ கூறினார்கள்: குர்ஆனில் 30 ஆயத்துகள் கொண்ட ஒரு ஸூரா, ஒரு மனிதனுக்காக பரிந்துரை செய்து, அவன் மன்னிக்கப்படும் வரை (அவனைப் பாதுகாத்தது); அது ‘தபாரக் அல்லதி பியதிஹில் முல்க்’ ஆகும். \n- ஜாமி அத் திர்மிதி \n\n 2. ஜாபிர் (ரலி) அறிவிக்கிறார்: நபி ﷺ தூங்கச் செல்லும் முன் ‘அலிஃப் லாம் மீம் (ஸஜ்தா)’ மற்றும் ‘தபாரக் அல்லதி பியதிஹில் முல்க்’ ஆகிய ஸூராக்களை ஓதாமல் தூங்க மாட்டார்கள். \n- ஜாமி அத் திர்மிதி, முஸ்னத் அஹ்மத்',
            path: 'surathul_mulk.json',
        },
        {
            title: 'ஸூரத்துஸ் ஸஜ்தா',
            description:
                '1. ஜாபிர் (ரலி) அறிவிக்கிறார்: நபி ﷺ தூங்கச் செல்லும் முன் ‘அலிஃப் லாம் மீம் (ஸஜ்தா)’ மற்றும் ‘தபாரக் அல்லதி பியதிஹில் முல்க்’ ஆகிய ஸூராக்களை ஓதாமல் தூங்க மாட்டார்கள். \n- ஜாமி அத் திர்மிதி, முஸ்னத் அஹ்மத் \n\n 2. அபூ ஹுரைரா (ரலி) கூறுகிறார்: நபி ﷺ வெள்ளிக்கிழமை ஃபஜ்ர் தொழுகையில் ‘அலிஃப் லாம் மீம் (ஸஜ்தா)’ மற்றும் ‘ஹல் அதா அலல் இன்ஸான்’ ஆகிய ஸூராக்களை ஓதுவார்கள். \n- ஸஹீஹுல் புகாரி, ஸஹீஹுல் முஸ்லிம்',
            path: 'suar_assajda.json',
        },
        {
            title: '1. ஸூரத்துல் இஹ்லாஸ்‌ \t 2. ஸூரத்துல் ஃபலக்‌ \t 3.ஸூரத்துந் நாஸ்',
            description:
                '1.நபி ﷺ கூறினார்கள்: “‘குல்ஹுவல்லாஹு அஹத்’ (ஸூரத்துல் இக்லாஸ்) குர்ஆனின் மூன்றில் ஒரு பகுதியிற்கு சமமானது.” \n- ஸஹீஹுல் புகாரி  \n\n 2.ஆயிஷா (ரலி) அறிவிக்கிறார்: “நபி ﷺ ஒவ்வொரு இரவும் தூங்கச் செல்லும் போது, தமது இரண்டு கைகளையும் சேர்த்து, அதில் ஊதி, ‘குல்ஹுவல்லாஹு அஹத்’, ‘குல்அஊது பிரப்பில் ஃபலக்’, ‘குல்அஊது பிரப்பின்னாஸ்’ ஆகிய ஸூராக்களை ஓதுவார்கள். பின்னர் தமது உடலில் எட்டியவரை தழுவுவார்கள்.” \n- ஸஹீஹுல் புகாரி \n\n 3. நபி ﷺ கூறினார்கள்: “நீ ‘குல்ஹுவல்லாஹு அஹத்’ மற்றும் இரண்டு முஅவ்விததைகள் (ஃபலக், நாஸ்) ஆகியவற்றை காலை மற்றும் மாலை மூன்று முறை ஓது; அவை உனக்கு எல்லாவற்றிலிருந்தும் போதுமானதாக இருக்கும். \n- ஜாமி அத் திர்மிதி”',
            path: 'three_kul_suraas.js',
        },
    ],
    verses: [
        {
            title: 'آية الكرسي (ஆயத்துல் குர்ஸி)',
            description:
                'நபி ﷺ என்னிடம் கூறினார்கள்: நீ தூங்கச் செல்லும் போது ஆயத்துல் குர்ஸியை ஓதினால், அல்லாஹ்வின் பாதுகாப்பு உன்னுடன் இருக்கும்; காலை வரை எந்த ஷைத்தானும் உன்னை அணுகாது. \n- அபூ ஹுரைரா (ரலி) / ஸஹீஹுல் புகாரி',
            path: 'aayathul_kursi.json',
        },
        {
            title: 'آمَنَ الرَّسُولُ (சூரத்துல் பகராவின் கடைசி இரண்டு ஆயத்துகள்)',
            description:
                'நபி ﷺ என்னிடம் கூறினார்கள்: சூரத்துல் பகராவின் கடைசி இரண்டு ஆயத்துகளை இரவில் ஓதுபவருக்கு அது போதுமானதாக இருக்கும். \n- அபூ மஸ்ஊத் அல்-அன்சாரி (ரலி) / ஸஹீஹுல் புகாரி, ஸஹீஹுல் முஸ்லிம்',
            path: 'aamanar_rasool.json',
        },
    ],
};

export default significantTableOfContents;
