// Table of Contents for Significant Verses and Suras
// Important verses and suras recommended by Prophet Muhammad ﷺ

const significantTableOfContents = {
    verses: [
        {
            title: 'آية الكرسي (ஆயத்துல் குர்ஸி)',
            description:
                'நபி ﷺ என்னிடம் கூறினார்கள்: நீ தூங்கச் செல்லும் போது ஆயத்துல் குர்ஸியை ஓதினால், அல்லாஹ்வின் பாதுகாப்பு உன்னுடன் இருக்கும்; காலை வரை எந்த ஷைத்தானும் உன்னை அணுகாது. - அபூ ஹுரைரா (ரலி) / ஸஹீஹுல் புகாரி',
            path: 'aayathul_kursi.json',
        },
        {
            title: 'آمَنَ الرَّسُولُ (சூரத்துல் பகராவின் கடைசி இரண்டு ஆயத்துகள்)',
            description:
                'நபி ﷺ என்னிடம் கூறினார்கள்: சூரத்துல் பகராவின் கடைசி இரண்டு ஆயத்துகளை இரவில் ஓதுபவருக்கு அது போதுமானதாக இருக்கும். - அபூ மஸ்ஊத் அல்-அன்சாரி (ரலி) / ஸஹீஹுல் புகாரி, ஸஹீஹுல் முஸ்லிம்',
            path: 'aamanar_rasool.json',
        },
    ],
    suras: [
        {
            title: 'ஸூரத்து யாஸீன்',
            path: 'sura_yaseen.json',
        },
        {
            title: 'ஸூரத்துல் முல்க்',
            description:
                "நபி ﷺ கூறினார்கள்: குர்ஆனில் 30 ஆயத்துகள் கொண்ட ஒரு ஸூரா, ஒரு மனிதனுக்காக பரிந்துரை செய்து, அவன் மன்னிக்கப்படும் வரை (அவனைப் பாதுகாத்தது); அது 'தபாரக் அல்லதி பியதிஹில் முல்க்' ஆகும். - ஜாமி அத் திர்மிதி",
            path: 'surathul_mulk.json',
        },
        {
            title: 'ஸூரத்துஸ் ஸஜ்தா',
            description:
                "அபூ ஹுரைரா (ரலி) கூறுகிறார்: நபி ﷺ வெள்ளிக்கிழமை ஃபஜ்ர் தொழுகையில் 'அலிஃப் லாம் மீம் (ஸஜ்தா)' மற்றும் 'ஹல் அதா அலல் இன்ஸான்' ஆகிய ஸூராக்களை ஓதுவார்கள். - ஸஹீஹுல் புகாரி, ஸஹீஹுல் முஸ்லிம்",
            path: 'suar_assajda.json',
        },
    ],
};

export default significantTableOfContents;
