export const tasbih_beeds = [
    {
        arabic: 'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ',
        tamilTransliteration: 'அஸ்தக்ஃபிருல்லாஹ வ அதூபு இலைஹி',
        tamilTranslation: 'நான் அல்லாஹ்விடம் மன்னிப்பு கேட்கிறேன்; அவனிடமே தவ்பா செய்து திரும்புகிறேன்.',
        haith: `
அபூ ஹுரைரா (ரழி) அவர்கள் அறிவித்தார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூற நான் கேட்டேன்: "அல்லாஹ்வின் மீது சத்தியமாக! நான் ஒரு நாளில் எழுபது தடவைகளுக்கு அதிகமாக அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி, அவனிடம் தவ்பா செய்கிறேன்."`,
    },
];
